#pragma once
#include <SFML/Graphics.hpp>

/////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////
///	 ласс содержит информацию о графической сотовл€ющей проекта: тектуры...
///	ћетоды:
///		загрузка изображений,
///		преобразование изображений в текстуры,
///		созданию спрайтов из текстур.
///	
///	»спользуетс€ в "GameRender"
///	
//////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////
class Graphics
{
protected:
	sf::Image dtileSet;
	sf::Texture dmainTexture;
public:
	Graphics();
	Graphics(const std::string& filename);
	void SetTexture();
	sf::Texture GetTexture() const;
};

